### Terraform :rocket:
#### Terraform init
```bash
Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for ai_search_svc...
- ai_search_svc in .terraform/modules/ai_search_svc/modules/ai-search
Downloading git::ssh://git@github.com/mtnvencenzo/terraform-modules.git for cezzis_keyvault...
- cezzis_keyvault in .terraform/modules/cezzis_keyvault/modules/key-vault
Downloading git::ssh://git@github.com/mtnvencenzo/terraform-modules.git for shared_servicebus_namespace...
- shared_servicebus_namespace in .terraform/modules/shared_servicebus_namespace/modules/servicebus-namespace
Initializing provider plugins...
- Finding hashicorp/azurerm versions matching "4.24.0"...
- Installing hashicorp/azurerm v4.24.0...
- Installed hashicorp/azurerm v4.24.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.


Warning: Reference to undefined provider

  on ai-search.tf line 4, in module "ai_search_svc":
   4:     azurerm = azurerm

There is no explicit declaration for local provider name "azurerm" in
module.ai_search_svc, so Terraform is assuming you mean to pass a
configuration for "hashicorp/azurerm".

If you also control the child module, add a required_providers entry named
"azurerm" with the source address "hashicorp/azurerm".

(and one more similar warning elsewhere)
Terraform has been successfully initialized!

```
#### Terraform format
```bash

```
#### Terraform validate
```bash

Warning: Reference to undefined provider

  on ai-search.tf line 4, in module "ai_search_svc":
   4:     azurerm = azurerm

There is no explicit declaration for local provider name "azurerm" in
module.ai_search_svc, so Terraform is assuming you mean to pass a
configuration for "hashicorp/azurerm".

If you also control the child module, add a required_providers entry named
"azurerm" with the source address "hashicorp/azurerm".
Success! The configuration is valid, but there were some validation warnings
as shown above.


```
#### Terraform plan
```bash
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.global_shared_resource_group: Reading...
data.azurerm_resource_group.cocktails_glo_resource_group: Reading...
data.azurerm_resource_group.global_network_resource_group: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjBhZTE4MC0zNWM4LTQ1ODktYTlkMS1iNjNkOWZkYzhmZmM7b2JqZWN0SWQ9ZmZlZmFiYWMtZmRhNC00ZTVkLWFlZTUtYWZlNTBkYzdkYTkzO3N1YnNjcmlwdGlvbklkPTFkOWVjYzAwLTI0MmEtNDYwZC04YjA4LWI3MWRiMTlmMDk0ZTt0ZW5hbnRJZD1hYmM0OTBlNS0zOTViLTRkYjEtOWQ5Zi0xODQzNGE0NTI2M2Q=]
data.azurerm_resource_group.global_shared_resource_group: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001]
azurerm_monitor_action_group.team_vecchi_action_group: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/actionGroups/ag-teamvecchi-vec-eus-glo-shared]
azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001]
azurerm_cdn_frontdoor_profile.afd: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001]
module.shared_servicebus_namespace.azurerm_servicebus_namespace.servicebus_namespace: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001]
azurerm_api_management.apim: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001]
data.azurerm_resource_group.global_network_resource_group: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001]
azurerm_virtual_network.global_vnet: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001]
data.azurerm_resource_group.cocktails_glo_resource_group: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001]
azurerm_dns_zone.cezzis_dns_zone: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.Network/dnsZones/cezzis.com]
azurerm_subnet.container_app_environment_subnet: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001/subnets/snet-vec-eus-glo-sharedcontainers-001]
module.cezzis_keyvault.azurerm_key_vault.keyvault: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-glo-cockti-1]
azurerm_application_insights.appi: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/components/appi-vec-eus-glo-shared-001]
azurerm_log_analytics_workspace_table.law_tables["AppBrowserTimings"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppBrowserTimings]
azurerm_log_analytics_workspace_table.law_tables["AppPageViews"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppPageViews]
azurerm_log_analytics_workspace_table.law_tables["AppSystemEvents"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppSystemEvents]
azurerm_log_analytics_workspace_table.law_tables["AppExceptions"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppExceptions]
azurerm_log_analytics_workspace_table.law_tables["AppMetrics"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppMetrics]
azurerm_log_analytics_workspace_table.law_tables["AppAvailabilityResults"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppAvailabilityResults]
azurerm_log_analytics_workspace_table.law_tables["AppTraces"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppTraces]
azurerm_log_analytics_workspace_table.law_tables["AppRequests"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppRequests]
azurerm_log_analytics_workspace_table.law_tables["AppPerformanceCounters"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppPerformanceCounters]
azurerm_log_analytics_workspace_table.law_tables["AppEvents"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppEvents]
azurerm_log_analytics_workspace_table.law_tables["AppDependencies"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppDependencies]
module.cezzis_keyvault.azurerm_key_vault_access_policy.keyvault_pipeline_access_policy: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-glo-cockti-1/objectId/ffefabac-fda4-4e5d-aee5-afe50dc7da93]
azurerm_container_app_environment.container_app_environment: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ai_search_svc.azurerm_search_service.search will be created
  + resource "azurerm_search_service" "search" {
      + customer_managed_key_encryption_compliance_status = (known after apply)
      + customer_managed_key_enforcement_enabled          = false
      + hosting_mode                                      = "default"
      + id                                                = (known after apply)
      + local_authentication_enabled                      = true
      + location                                          = "eastus"
      + name                                              = "srch-vec-eus-glo-shared-001"
      + network_rule_bypass_option                        = "None"
      + partition_count                                   = 1
      + primary_key                                       = (sensitive value)
      + public_network_access_enabled                     = true
      + query_keys                                        = (known after apply)
      + replica_count                                     = 1
      + resource_group_name                               = "rg-vec-eus-glo-shared-001"
      + secondary_key                                     = (sensitive value)
      + sku                                               = "free"
      + tags                                              = {
          + "Application" = "shared"
          + "Environment" = "glo"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on ai-search.tf line 4, in module "ai_search_svc":
   4:     azurerm = azurerm

There is no explicit declaration for local provider name "azurerm" in
module.ai_search_svc, so Terraform is assuming you mean to pass a
configuration for "hashicorp/azurerm".

If you also control the child module, add a required_providers entry named
"azurerm" with the source address "hashicorp/azurerm".

```

*This is a comment created by the terraform-plan-and-apply.yaml workflow. It will be updated if the workflow is run again.*